Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  127932.640625
MEAN SQUARED LOSS:  26.280328805464258
STANDARD DEVIATION:  470.0177307128906
