Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  134953.78125
MEAN SQUARED LOSS:  27.722633781840592
STANDARD DEVIATION:  413.1293029785156
