Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  129840.875
MEAN SQUARED LOSS:  26.672324363188167
STANDARD DEVIATION:  205.48988342285156
