Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  113532.453125
MEAN SQUARED LOSS:  23.54956505393072
STANDARD DEVIATION:  34.874595642089844
