Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  115510.703125
MEAN SQUARED LOSS:  23.959905232316945
STANDARD DEVIATION:  59.798221588134766
