Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  116964.8125
MEAN SQUARED LOSS:  24.433844265719657
STANDARD DEVIATION:  69.13871002197266
