Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  144839.59375
MEAN SQUARED LOSS:  27.00216140007457
STANDARD DEVIATION:  91.43986511230469
