Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  151645.46875
MEAN SQUARED LOSS:  28.270967328486204
STANDARD DEVIATION:  358.488037109375
