Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  156070.65625
MEAN SQUARED LOSS:  28.907326588257085
STANDARD DEVIATION:  126.56836700439453
