Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  163515.09375
MEAN SQUARED LOSS:  30.286181468790517
STANDARD DEVIATION:  466.225341796875
