Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  140626.859375
MEAN SQUARED LOSS:  26.61875059151997
STANDARD DEVIATION:  53.25394821166992
