Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  154029.359375
MEAN SQUARED LOSS:  29.155661437630133
STANDARD DEVIATION:  517.474365234375
