Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  165656.390625
MEAN SQUARED LOSS:  31.126717516910936
STANDARD DEVIATION:  509.1588134765625
