Net(
  (model): Sequential(
    (0): Linear(in_features=100, out_features=64, bias=True)
    (1): ReLU()
    (2): Linear(in_features=64, out_features=100, bias=True)
  )
)
TOTAL SQUARED LOSS:  157607.53125
MEAN SQUARED LOSS:  29.61434258737317
STANDARD DEVIATION:  150.92837524414062
